{
    "timeline" : {
        "name" : "You are not the author of the timeline",
        "description" : "Book of Revelation &amp; Book of Daniel - Bible End Times Prophecy Timeline"
    },

    "groups" : [
          ],

    "events" : [
              {
          "name" : "September 11, 2001\n\nAttack on World Trade Center \nand the Pentagon",
          "description" : "https:\/\/www.biblestudy.org\/bibleref\/meaning-of-numbers-in-bible\/911.html\n\nhttps:\/\/www.biblestudy.org\/question\/names-for-devil.html\n\nhttps:\/\/richardgage911.org\/",
          "tagsCsv" : "",
          "time" : "2001 9 11",
          "group" : ""
        },
              {
          "name" : "September 30, 2007 - Washington, D.C.\n\nThe Four Horsemen: \n- The Conversation That Sparked an Atheist Revolution -\n\nRev 9:18  By these three was the third \npart of men killed, by the fire, and by the\nsmoke, and by the brimstone, which issued\nout of their mouths.",
          "description" : "The Four Horsemen HD: Hour 1 of 2 - Discussions with Richard Dawkins, Ep 1\nhttps:\/\/www.youtube.com\/watch?v=9DKhc1pcDFM\n\nThe Four Horsemen: Hour 2 of 2 - Discussions with Richard Dawkins, Ep 1\nhttps:\/\/www.youtube.com\/watch?v=TaeJf-Yia3A\n\nhttps:\/\/en.wikipedia.org\/wiki\/New_Atheism\nDuring \"The God Debate\" in 2010 with Hitchens versus Dinesh D'Souza, the group was collectively referred to as the \"Four Horsemen of the Non-Apocalypse\",[24] an allusion to the biblical Four Horsemen of the Apocalypse from the Book of Revelation.[25] The four have been described as \"evangelical atheists\".[26]\n\nRev 9:18  By these three was the third part of men killed, by the fire, and by the smoke, and by the brimstone, which issued out of their mouths.\n\n\n3 out of the 4 horsemen supported the notion of depopulation.\n\nBy These Three\nSo how do we know that Sam Harris did not have Overpopulation on his agenda?\nYou can hear Sam Harris say it directly on this Youtube recording:\n\nOverpopulation: Sam Harris is unsure (YouTube)\nhttps:\/\/www.youtube.com\/watch?v=5Lo7-lesLwQ\n\nWhen asked about the concerns of overpopulation, Sam Harris answered:\n“I’m pretty pronatalist”… “I think as a utilitarian, the more people the better”\n(straight from the horse’s mouth)\npronatalist (definition): encouraging an increased birthrate",
          "tagsCsv" : "",
          "time" : "2007 9 30 0 0",
          "group" : ""
        },
              {
          "name" : "03\/05\/2027\n1335 days out before 2nd Coming of Christ\n\nDaniel 12:12 - \nBlessed is he that waiteth, \nand cometh to the thousand \nthree hundred and five and \nthirty days.",
          "description" : "Blessed is he that waiteth, and cometh to the thousand three hundred and five and thirty days.\n\n1335 days before the Coming of Christ\n\nhttps:\/\/www.timeanddate.com\/date\/dateadded.html?d1=30&m1=10&y1=2030&type=sub&ay=&am=&aw=&ad=1335&rec=\n\n# Days Perfectly divisible by 3 and 5\n1335 \/ 3 = 445\n1335 \/ 5 = 267\n\nSum of digits\n445 = (4 + 4 + 5) = 13 = (1+3) = 4\n267 = (2 + 6 + 7) = 15 = (1+5) = 6\n------ Total               28 = (2+8)\n712 (7+1+2)                             = 10\n\nNotice how 10 signifies completeness.\n\nWhat does 3 signify in the Bible?\nhttps:\/\/www.biblestudy.org\/bibleref\/meaning-of-numbers-in-bible\/3.html\n\nWhat does 4 signify in the Bible?\nhttps:\/\/www.biblestudy.org\/bibleref\/meaning-of-numbers-in-bible\/4.html\n\nWhat does 5 signify in the Bible?\nThe number 5 symbolizes God's grace, goodness and favor toward humans.\nhttps:\/\/www.biblestudy.org\/bibleref\/meaning-of-numbers-in-bible\/5.html\n\nWhat does 6 signify in the Bible?\nThe number 6 and its meaning is related to man and human weakness, the evils of the devil and the manifestation of sin. Man was created on day six of creation week. Men are appointed 6 days to labor.\nhttps:\/\/www.biblestudy.org\/bibleref\/meaning-of-numbers-in-bible\/6.html\n\nWhat does 13 signify in the Bible?\nhttps:\/\/www.biblestudy.org\/bibleref\/meaning-of-numbers-in-bible\/13.html\n\nWhat does 15 signify in the Bible? (15 promises of God)\nhttps:\/\/www.biblestudy.org\/bibleref\/meaning-of-numbers-in-bible\/13.html\n\nWhat does 10 signify in the Bible?\nhttps:\/\/www.biblestudy.org\/bibleref\/meaning-of-numbers-in-bible\/10.html\n\nMonth 10 - Completeness\n\nDay 30 - 2nd Coming of Christ\nhttps:\/\/www.biblestudy.org\/bibleref\/meaning-of-numbers-in-bible\/30.html\n\n3 parts of 10 is 30 which symbolizes \nGod's prophetic clock: 3-7-10\n\nRead the following for more understanding on God's prophetic clock:\nhttps:\/\/rolandsanluis.substack.com\/p\/the-mark-of-the-beast-is-it-ai-x\n\nYear 2030\nChrist will come back in 2 days after crucifixion date\n\n2 Peter 3:8 - But, beloved, do not forget this one thing, that with the Lord one day is as a thousand years, and a thousand years as one day.\n2 * 1000 after crucifixion date 30AD = 2030 AD\n2000 + 30AD = 2030 AD\n\nJohn 4:40, Luke 10:35",
          "tagsCsv" : "",
          "time" : "2027 3 5 0 0",
          "group" : ""
        },
              {
          "name" : "10\/26\/2030\nSun turned into darkness\nThere was a great earthquake\nMoon became as blood \nbefore 2nd Coming of Christ",
          "description" : "Joel 2:31\nThe sun shall be turned into darkness, and the moon into blood, before the great and terrible day of the Lord.\n\nActs 2:20\nThe sun shall be turned into darkness, and the moon into blood, before the great and notable day of the Lord.\n\nRevelation 6:12\nAnd I beheld when he had opened the sixth seal, and, lo, there was a great earthquake; and the sun became black as sackcloth of hair, and the moon became as blood.\n\nClick on picture above that was generated by:\nhttps:\/\/stellarium-web.org\/\n\nRecreate the image by selecting the date:\n10\/26\/2030\nNotice the moon darkening the sun throughout the daytime when you toggle the hours up\/down.",
          "tagsCsv" : "",
          "time" : "2030 10 26",
          "group" : ""
        },
              {
          "name" : "10\/27\/2030 - 3 days before return of Christ\n\nThe two Prophets die \n(Revelation 11:7) \nAll shall see their dead bodies 3.5 days",
          "description" : "Revelation 11:7 And when they shall have finished their testimony, the beast that ascendeth out of the bottomless pit shall make war against them, and shall overcome them, and kill them. 8 And their dead bodies shall lie in the street of the great city, which spiritually is called Sodom and Egypt, where also our Lord was crucified. 9And they of the people and kindreds and tongues and nations shall see their dead bodies three days and an half, and shall not suffer their dead bodies to be put in graves. 10 And they that dwell upon the earth shall rejoice over them, and make merry, and shall send gifts one to another; because these two prophets tormented them that dwelt on the earth. \n\nJeremiah 25:33 (references Rev 11:8-9)\nAnd the slain of the LORD shall be at that day from one end of the earth even unto the other end of the earth: they shall not be lamented, neither gathered, nor buried; they shall be dung upon the ground.",
          "tagsCsv" : "",
          "time" : "2030 10 27",
          "group" : ""
        },
              {
          "name" : "10\/30\/2030 - 2nd Coming of Christ & Rapture of the Church\n\nMatthew 24:27 - For as the lightning cometh\nout of the east and shineth even unto the west, \nso shall also the coming of the Son of Man be.\n\nRevelation 1:7 \nBehold, he is coming with the clouds, \nand every eye will see him,\neven those who pierced him, \nand all tribes of the earth will \nwail on account of him. \nEven so. Amen.",
          "description" : "2nd coming of Christ (10\/30\/2030)\n\nIsaiah 46:9 Remember the former things of old: for I am God, and there is none else; I am God, and there is none like me, 10 declaring the end from the beginning, and from ancient times the things that are not yet done, saying, My counsel shall stand, and I will do all my pleasure: 11 calling a ravenous bird from the east, the man that executeth my counsel from a far country: yea, I have spoken it, I will also bring it to pass; I have purposed it, I will also do it.\n\nMatthew 24:27 - For as the lightning cometh out of the east and shineth even unto the west, \nso shall also the coming of the Son of Man be.\n\nRevelation 1:7 - Behold, he is coming with the clouds, and every eye will see him, even those who pierced him, and all tribes of the earth will wail on account of him. Even so. Amen.\n\nRevelation 11:11-12 And after 3.5 days the spirit of life from God entered into them, and they stood upon their feet; and great fear fell upon them which saw them. \n\nNotice in the picture above that the planet Venus is aligned w\/the sun.\nRead the following article:\nhttps:\/\/www.epm.org\/resources\/2010\/Mar\/29\/jesus-venus-and-morning-star\/\n\nMatthew 24:36\nBut of that day and hour knoweth no man, \nno, not the angels of heaven, \nbut my Father only\n\nThis statement is correct if you recreate the image on Stellerium-Web.\n(Day AND Hour)\n(Day && Hour)\nImportant: You will not know the exact hour.  \nSun & Venus overlap for the entire day.\n\n1 Thessalonians 4:14  For if we believe that Jesus died and rose again, even so them also which sleep in Jesus will God bring with him. \n\n1 Thessalonians 4:17 - Then we which are alive and remain shall be caught up together with them in the clouds, to meet the Lord in the air: and so shall we ever be with the Lord.\n\n1 Corinthians 15:52\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed.\n\nJeremiah 8:1  At that time, saith the LORD, they shall bring out the bones of the kings of Judah, and the bones of his princes, and the bones of the priests, and the bones of the prophets, and the bones of the inhabitants of Jerusalem, out of their graves: \n\nEzekial 37:9 Then said he unto me, Prophesy unto the wind, prophesy, son of man, and say to the wind, Thus saith the Lord GOD; Come from the four winds, O breath, and breathe upon these slain, that they may live. 10 So I prophesied as he commanded me, and the breath came into them, and they lived, and stood up upon their feet, an exceeding great army. 11 Then he said unto me, Son of man, these bones are the whole house of Israel: behold, they say, Our bones are dried, and our hope is lost: we are cut off for our parts. 12 Therefore prophesy and say unto them, Thus saith the Lord GOD; Behold, O my people, I will open your graves, and cause you to come up out of your graves, and bring you into the land of Israel. 13 And ye shall know that I am the LORD, when I have opened your graves, O my people, and brought you up out of your graves, 14 and shall put my spirit in you, and ye shall live, and I shall place you in your own land: then shall ye know that I the LORD have spoken it, and performed it, saith the LORD.",
          "tagsCsv" : "",
          "time" : "2030 10 30 0 0",
          "group" : ""
        }    ],

    "periods" : [
              {
          "name" : "Georgia Guidestones 03\/22\/1980 - 07\/06\/2022\n\nThe destruction of the Georgia Guidestones signify an end to a 42 year period that will usher in the start of the Tribulation.",
          "description" : "07\/6\/2022 - 11\/1\/2023 = 69 literal weeks\nhttps:\/\/www.timeanddate.com\/date\/durationresult.html?d1=6&m1=7&y1=2022&d2=1&m2=11&y2=2023\n\nhttps:\/\/www.biblestudy.org\/bibleref\/meaning-of-numbers-in-bible\/42.html\nThe Meaning of Numbers: The Number 42\nIn Scripture, the meaning of the number 42 is derived from its direct connection to the coming Antichrist. His evil efforts will last forty-two months in the end time, and thus it is firmly associated with him.\n\nThen the angel gave me a measuring rod like a staff, saying, \"Arise and measure the temple of God, and the altar . . . and they shall trample upon the holy city for forty-two (42) months\" (Revelation 11:1 - 2)\n\n\n03\/22\/1980 + 15446 days  = 07\/06\/2022\nhttps:\/\/www.timeanddate.com\/date\/dateadded.html?d1=22&m1=3&y1=1980&type=add&ay=&am=&aw=&ad=15446&rec=\n\nhttps:\/\/en.wikipedia.org\/wiki\/Georgia_Guidestones\n\nA message consisting of a set of ten guidelines or principles was engraved on the Georgia Guidestones in eight different languages, one language on each face of the four large upright stones. Moving clockwise around the structure from due north, these languages were English, Spanish, Swahili, Hindi, Hebrew, Arabic, Traditional Chinese, and Russian.[11] The languages were chosen because they represented most of humanity, except for Hebrew, which was chosen because of its connections to Judaism and Christianity.[11] According to the monument's sponsors, the inscriptions are meant to guide humanity to conserve nature after a nuclear war, which the creators thought was an imminent threat.[11][13] The inscriptions dealt with four main themes: \"governance and the establishment of a world government, population and reproduction control, the environment and humankind's relationship to nature, and spirituality.\"[2]\n\nThe inscription read:[2][23]\n\n1. Maintain humanity under 500,000,000 in perpetual balance with nature.\n2. Guide reproduction wisely – improving fitness and diversity.\n3. Unite humanity with a living new language.\n4. Rule passion – faith – tradition – and all things with tempered reason.\n5. Protect people and nations with fair laws and just courts.\n6. Let all nations rule internally resolving external disputes in a world court.\n7. Avoid petty laws and useless officials.\n8. Balance personal rights with social duties.\n9. Prize truth – beauty – love – seeking harmony with the infinite.\n10. Be not a cancer on the Earth – Leave room for nature – Leave room for nature.\n\n\nThe text of the explanatory tablet was somewhat inconsistent with respect to punctuation and misspelled the word \"pseudonym\". The original spelling, punctuation, and line breaks in the text have been preserved in the transcription (letter case is not). At the top center of the tablet was written:\n\nThe Georgia Guidestones\nCenter cluster erected March 22, 1980\n\nImmediately below this was the outline of a square, inside which was written:\n\nLet these be guidestones to an Age of Reason\n\n\n\nhttps:\/\/en.wikipedia.org\/wiki\/The_Hitchhiker%27s_Guide_to_the_Galaxy\n\n42, or The Answer to the Ultimate Question of Life, The Universe, and Everything\n\nWhen Musk launched his Tesla Roadster into an elliptical heliocentric orbit as part of the initial test launch of the Falcon Heavy, he had a copy of Douglas Adams' novel The Hitchhiker's Guide to the Galaxy in the glovebox, along with references to the book in the form of a towel and a sign on the dashboard that reads \"DON'T PANIC!\", as a nod to the Hitchhiker's Guide.[97]",
          "tagsCsv" : "",
          "timeFrom" : "1980 3 22 0 0",
          "timeTo" : "2022 7 6 0 0",
          "group" : ""
        },
              {
          "name" : "8086 days between \n09\/11\/2001 and 11\/01\/2023\n\nH8086 corresponds to H8086 which is to hear, obey",
          "description" : "https:\/\/www.timeanddate.com\/date\/dateadded.html?d1=11&m1=9&y1=2001&type=add&ay=&am=&aw=&ad=8086&rec=\n\nH8086\n\nshem-ah'\n\n(Chaldee); corresponding to H8085: - hear, obey.\n\nTotal KJV occurrences: 9\n\nThose 9 occurrences are all found in the Book of Daniel.\n9 verses, 9 matches in KJV",
          "tagsCsv" : "",
          "timeFrom" : "2001 9 11 0 0",
          "timeTo" : "2023 11 1 0 0",
          "group" : ""
        },
              {
          "name" : "September 23, 2017 \n\nRevelation 12:1 - And there appeared a great\nwonder in heaven; a woman clothed with the\nsun, and the moon under her feet, and upon\nher head a crown of twelve stars:\n\nHebrew Strong code for 2230 is:\nH2230 -  flood, overflowing, shower, storm, tempest\n\n\n\n\n\nExactly 2230 days from 11\/01\/2023",
          "description" : "September 23, 2017 - Exactly 2230 days from 11\/01\/2023\n\nRevelation 12:1 - And there appeared a great wonder in heaven; a woman clothed with the sun, and the moon under her feet, and upon her head a crown of twelve stars:\n\nHebrew Strong code for 2230 is:\nH2230 -  flood, overflowing, shower, storm, tempest\n\nhttps:\/\/www.timeanddate.com\/date\/durationresult.html?m1=9&d1=23&y1=2017&m2=11&d2=1&y2=2023\n\nThe Revelation 12 Sign in 5 Minutes! September 23 2017 Alignment Explained What you need to know\nhttps:\/\/www.youtube.com\/watch?v=ZSqPiR2EK2s\n\nUse https:\/\/stellarium-web.org\/\nUse the Great City of Babylon \n(New York, NY) as the location.\nEnter the date 09-23-2017\n\nYou will clearly see Revelation 12:1\n- A woman clothed with the sun\n- Moon under her feet\n- 12 stars crowning her head",
          "tagsCsv" : "",
          "timeFrom" : "2017 9 23 0 0",
          "timeTo" : "2023 11 1 0 0",
          "group" : ""
        },
              {
          "name" : "07\/06\/2022 - 11\/01\/2023\n69 literal weeks from destruction of \nGeorgia Guidestones to 11\/01\/2023\n\nThere are 66 verse matches, 69 word matches of the word obey in the entire KJV Bible\n\nThe number is 69 is a crucial number\n69 in the bible signifies the order to obey God's commands, while Satan tries to make man defy God's laws\nhttps:\/\/en.wikipedia.org\/wiki\/The_Satanic_Bible",
          "description" : "07\/06\/2022 - 11\/01\/2023\n69 literal weeks from destruction of \nGeorgia Guidestones to 11\/01\/2023\n\nhttps:\/\/www.timeanddate.com\/date\/durationresult.html?d1=6&m1=7&y1=2022&d2=1&m2=11&y2=2023\n\n\nThere are 66 verse matches, 69 word matches of the word obey in the entire KJV Bible\n\nPsalms 69\nhttps:\/\/www.bible.com\/bible\/111\/PSA.69.NIV\n\nhttps:\/\/www.biblestudy.org\/bibleref\/meaning-of-numbers-in-bible\/66.html\n\nPaul, the most influential New Testament Christian, is about 66 years old when he is martyred in Rome in 68 A.D.\n\nIn most modern Bible translations, the 66th\nbook is Revelation.\n\nThere are 3 books\n1. Lamentations 3\n2. 1Kings 8\n3. Matthew 27 \n\nwhich have exactly exactly 66 verses",
          "tagsCsv" : "",
          "timeFrom" : "2022 7 6 0 0",
          "timeTo" : "2023 11 1 0 0",
          "group" : ""
        },
              {
          "name" : "08\/24\/2022\nEmmanuel Macron signalled \n\"The End of Abundance\" and \nwarned that \"Sacrifices\" are ahead\n\nHis announcement on 08\/24\/2022 \nis 62 weeks away from 11\/01\/2023\nThis is 7 weeks after 07\/06\/2022 \n(The destruction of the Georgia Guidestones)\n\nDaniel 9:26\n26And after threescore and two weeks shall\nMessiah be cut off, but not for himself: and \nthe people of the prince that shall come shall\ndestroy the city and the sanctuary; and the end\nthereof shall be with a flood, and unto the end\nof the war desola",
          "description" : "His announcement on 08\/24\/2022 \nis 62 weeks away from 11\/01\/2023\nThis is 7 weeks after 07\/06\/2022 \n(The destruction of the Georgia Guidestones)\nhttps:\/\/www.timeanddate.com\/date\/dateadded.html?d1=6&m1=7&y1=2022&type=add&ay=&am=&aw=7&ad=&rec=\n\nhttps:\/\/www.youtube.com\/watch?v=IU8p_nuK6Yw\nMacron warns 'sacrifices' ahead after 'end of abundance' • FRANCE 24 English\n\nhttps:\/\/www.amazon.com\/2030-Second-Coming-Tribulation-plenty\/dp\/1502460076\/\n\nGenesis 41:53 Then the seven years of plenty which were in the land of Egypt ended, 54 and the seven years of famine began to come, as Joseph had said. The famine was in all lands, but in all the land of Egypt there was bread.\n\nhttps:\/\/www.biblestudy.org\/bibleref\/meaning-of-numbers-in-bible\/62.html\n\nPsalm 62 is a relatively short song penned by King David. It reflects his faith and quiet resolve in God's care in spite of whatever the wicked may do.\n\nMore info on Biblical Meaning of 62\nIsaiah 62 is a chapter that primarily addresses the preparation for the Lord's Second Coming and the glorious restoration of His people.",
          "tagsCsv" : "",
          "timeFrom" : "2022 8 22 0 0",
          "timeTo" : "2023 11 1 0 0",
          "group" : ""
        },
              {
          "name" : "1290 days to Set Up of Abomination of Desolation\nStarts 10\/07\/2023",
          "description" : "10\/07\/2023\n1290 days between Sacrifice taken away and Abomination of Desolation Set Up Day\n\nDaniel 12:11 And from the time that the \ndaily sacrifice shall be taken away, \nand the abomination that maketh desolate\nset up, there shall be a 1290 days.\n\n\nhttps:\/\/www.timeanddate.com\/date\/dateadded.html?d1=7&m1=10&y1=2027&type=add&ay=&am=&aw=&ad=1290&rec=\n\nThis aligns with God's prophetic clock:\n3 - 7 - 10\n\nFrom 10\/7\/23 to Set Up Date of Abomination of Desolation 4\/19\/27 = 1290 days\n\nThen 1290 added to that day (4\/19\/27) = 1290 days out until 10\/30\/2030 (2nd Coming of Christ)\n\n1290 * 2 = 2580 days\n2580 days divided by 3 parts denoted by God's prophetic clock\n2580 \/ 3 = 860 days\nor 2580 \/ 30 = 86 months\n\n3 parts of 860 days or 86 months\n\nhttps:\/\/www.biblestudy.org\/bibleref\/meaning-of-numbers-in-bible\/86.html\nFound 86 times in the Greek text of the New Testament, kairos (Strong's #G2540) is usually translated as \"time,\" \"times\" or \"seasons.\" It is used in Revelation's final chapter to underscore that its prophecies could be understood by those who read them! This is in direct contrast to Daniel's prophecies that, at the time he wrote his book, could not be understood by those who read them (Daniel 12:9).\n\n\n86*10^1 + 86*10^1 + 86*10^1 = 2580\n\nSum of all individual digits\n(8+6) = 14 \nhttps:\/\/www.biblestudy.org\/bibleref\/meaning-of-numbers-in-bible\/14.html\n\n2+5+8+0 = 15\nhttps:\/\/www.biblestudy.org\/bibleref\/meaning-of-numbers-in-bible\/15.html\n15 promises of God as written in the Book of Matthew",
          "tagsCsv" : "",
          "timeFrom" : "2023 10 7 0 0",
          "timeTo" : "2027 4 19 0 0",
          "group" : ""
        },
              {
          "name" : "11\/01\/2023 - Starting Day of Tragic Events\n\n11\/01\/2023-12\/06\/2023 Possible Tsunami\/Flood Date Range \nfor (Revelation 8:8)\n\n35 days of bloodshed until the start of Tribulation\n11\/01\/2023 + 35 days = 12\/06\/2023 (Start of Tribulation)\n\nJohn 11:35 Jesus wept.\n\nRevelation 8:8 cross references Amos 8:8\n\nDaniel 11:22\nAnd with the arms of a flood shall they be\noverflown from before him, and shall be\nbroken; yea, also the prince of the covenant.",
          "description" : "Possible Tsunami\/Flood Date Range\n\nRevelation 8:8 cross references Amos 8:8\n\n69 weeks from destruction of Georgia Guidestones\n\nPsalm 69\n1 Save me, O God;\nFor the waters are come in unto my soul.\n\n2 I sink in deep mire, where there is no\nstanding:\nI am come into deep waters, where the floods overflow me.\n3 I am weary of my crying: my throat is dried:\nMine eyes fail while I wait for my God.\n\n35 days added to 11\/1\/2023 is the start of\nTribulation: 12\/06\/2023\n\nhttps:\/\/www.biblestudy.org\/bibleref\/meaning-of-numbers-in-bible\/35.html\n\nAlthough the meaning of number 35 is unclear in Scripture, it does have some relationship with the Apostle Paul.\n\nPaul's ministry begins in 33 A.D., the same year he is converted while traveling to Damascus. After at least five evangelistic journeys and countless trials, his service to God ends after 35 years when he is martyred in Rome in 68 A.D.\n\nApostle Paul, in the KJV, uses the word \"blood\" 35 times throughout his fourteen books.\n\nIn the Old Testament, there are 35 matches of the word \"flood\".  To recreate, search for flood within KJV using e-Sword Bible Software, filter only on OT (Old Testament)\n\nAmos 8:8 Shall not the land tremble for this, and every one mourn that dwelleth therein? and it shall rise up wholly as a flood; and it shall be cast out and drowned, as by the flood of Egypt. \n\n2555 days away from 10\/30\/2030",
          "tagsCsv" : "",
          "timeFrom" : "2023 11 11 0 0",
          "timeTo" : "2023 12 6 0 0",
          "group" : ""
        },
              {
          "name" : "7 Year Tribulation (7 years of famine)\n\nBlood\/Flood  11\/01\/2023  + 35 days\nStarts             12\/06\/2023  (Start of the 70th week)\nMidWeek       05\/19\/2027 (Abomination of Desolation)\nEnds               10\/30\/2030  (When Christ Returns)",
          "description" : "Genesis 41:53 Then the seven years of plenty which were in the land of Egypt ended, 54 and the seven years of famine began to come, as Joseph had said. The famine was in all lands, but in all the land of Egypt there was bread.\n\nUsing e-Sword software:\nSearch for Flood in the Old Testament\n  You get 35 matches\nSearch for Blood in the Paul's Letters\n  You get 35 matches\n\nJohn 11:1 Now a certain man was sick, named Lazarus\n35 verses later\nJohn 11:35 Jesus wept.\n\nThe 35 matches of flood from the old testament and the 35 matches of blood from Paul's letters a start of the 70th week.\n\nLazarus in the present time, represents the multitude that are asleep (either in rest or alive but asleep the the truth).  These are the two thirds that will die of the plague or perish by the famine as stated in Ezekiel 5:12\n\nEzekial 5:12 A third part of thee shall die with the pestilence, and with famine shall they be consumed in the midst of thee: and a third part shall fall by the sword round about thee; and I will scatter a third part into all the winds, and I will draw out a sword after them.\n\nAlso, Genesis 11:1 signifies the whole earth was of one language, and one speech.\n\nThat day has come again, where language barriers have come down with the advent of AI.\nhttps:\/\/about.fb.com\/news\/2022\/10\/hokkien-ai-speech-translation\/\nMeta AI built the first speech translator that works for languages that are primarily spoken rather than written. We're open sourcing this so people can use it for more languages.\n\nhttps:\/\/www.timeanddate.com\/date\/dateadded.html?d1=06&m1=12&y1=2023&type=add&ay=&am=&aw=&ad=1260&rec=\n\nhttps:\/\/www.timeanddate.com\/date\/dateadded.html?d1=19&m1=5&y1=2027&type=add&ay=&am=&aw=&ad=1260&rec=\n\n12\/06\/2023 plus (1260 * 2) days\n12\/06\/2023 plus 2520 days\n\nhttps:\/\/www.timeanddate.com\/date\/dateadded.html?d1=06&m1=12&y1=2023&type=add&ay=&am=&aw=&ad=2520&rec=\n\n2023 END-TIMES PROPHECY (70th Week of Daniel Revealed)\nhttps:\/\/www.youtube.com\/watch?v=aw2p06bgyKg&t=2486s",
          "tagsCsv" : "",
          "timeFrom" : "2023 12 6 0 0",
          "timeTo" : "2030 10 30 0 0",
          "group" : ""
        },
              {
          "name" : "3.5 years (1260 days) - 42 months\nStarts 12\/06\/2023\n\n35 days after 11\/01\/2023 Tsunami Flood",
          "description" : "3.5 years\n1260 days \/ 30 days = 42 months\n\n2023 END-TIMES PROPHECY (70th Week of Daniel Revealed)\nhttps:\/\/www.youtube.com\/watch?v=aw2p06bgyKg&t=2486s",
          "tagsCsv" : "",
          "timeFrom" : "2023 12 6 0 0",
          "timeTo" : "2027 5 19 0 0",
          "group" : ""
        },
              {
          "name" : "07\/13\/2024 - 10\/30\/2030 (2300 days)\n\nDaniel 8:13-14\n\n13 Then I heard one saint speaking, and\nanother saint said unto that certain saint\nwhich spake, How long shall be the vision\nconcerning the daily sacrifice, and the\ntransgression of desolation, to give both the\nsanctuary and the host to be trodden under\nfoot? 14And he said unto me, Unto two\nthousand and three hundred days; then shall\nthe sanctuary be cleansed.",
          "description" : "Daniel 8:13 Then I heard one saint speaking, and another saint said unto that certain saint which spake, How long shall be the vision concerning the daily sacrifice, and the transgression of desolation, to give both the sanctuary and the host to be trodden under foot? 14 And he said unto me, Unto two thousand and three hundred days; then shall the sanctuary be cleansed.\n\nhttps:\/\/www.gotquestions.org\/prophecy-2300-days-Daniel.html\nDaniel 8 speaks of 2,300 days in a prophecy concerning a persecution of the Jewish people during the intertestamental period. Similarly, in Revelation 11 and 12, John mentions 1,260 days in two prophecies concerning another persecution of the Jews during the end times. The main differences between these two prophecies are 1) Daniel’s has been fulfilled, and John’s has not; and 2) Daniel predicts the actions of Antiochus Epiphanes, and John predicts those of the Antichrist.\n\nThe prophecy of the 2,300 days (“evenings and mornings”) is found in Daniel 8:13–14:\n\n“Then I heard a holy one speaking, and another holy one said to him, ‘How long will it take for the vision to be fulfilled—the vision concerning the daily sacrifice, the rebellion that causes desolation, the surrender of the sanctuary and the trampling underfoot of the Lord’s people?’ He said to me, ‘It will take 2,300 evenings and mornings; then the sanctuary will be reconsecrated.’”\n\nThe time period covered, 2,300 days, figures to about 6 1\/3 years.",
          "tagsCsv" : "",
          "timeFrom" : "2024 7 13",
          "timeTo" : "2030 10 30 0 0",
          "group" : ""
        },
              {
          "name" : "1290 days to 2nd Coming of Christ\nStarts 04\/19\/2027 - Set Up for Abomination of Desolation\n30 days before Abomination of Desolation",
          "description" : "Abomination of Desolation is set up (04\/19\/2027)\n\n30 days before Mid Week\n1290 days before 2nd Coming of Christ",
          "tagsCsv" : "",
          "timeFrom" : "2027 4 19 0 0",
          "timeTo" : "2030 10 30 0 0",
          "group" : ""
        },
              {
          "name" : "3.5 years (1260 days) - 42 months\nStarts 05\/19\/2027 - Abomination of Desolation",
          "description" : "3.5 years\n1260 days \/ 30 days = 42 months\n\n12\/06\/2023 plus    1260 days is 05\/19\/2027\n10\/30\/2030 minus 1260 days is 05\/19\/2027\n\nMatthew 24:15-16 \n“So when you see the abomination of desolation spoken of by the prophet Daniel, standing in the holy place (let the reader understand), 16 then let those who are in Judea flee to the mountains.\n\nDaniel 9:27\nHe will confirm a covenant with many for one ‘seven.’ In the middle of the ‘seven’ he will put an end to sacrifice and offering. And at the temple he will set up an abomination that causes desolation, until the end that is decreed is poured out on him.”\n\nMatthew 24:19 \nHow dreadful it will be in those days for pregnant women and nursing mothers!\n(relates to Revelation 12:6)\n\nRevelation 12:6\nThe woman fled into the wilderness to a place prepared for her by God, where she might be taken care of for 1,260 days.\n\n1,260 days = 1260 \/ 30 = 42 months = 3.5 yrs\n\nDays from 5\/19\/2027 to 10\/30\/2030 = 1260 days",
          "tagsCsv" : "",
          "timeFrom" : "2027 5 19 0 0",
          "timeTo" : "2030 10 30 0 0",
          "group" : ""
        }    ],

    "progresses" : [
          ],

    "statistics" : [
          ],

    "statisticsYandexMetrika" : [
          ],

    "statisticsGoogleAnalytics" : [
          ],

    "reportingAPIs" : [
          ],

    "tags" : [
          ]
}